<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"e55464b0ab08fb1437511450302d5575aa97953879166a1fb85a0b7eefd2d5ce","plan_job_ref":"Job Terraform checks on pull request #33 at https://github.com/sudoblark/sudoblark.monsternames.api/actions/runs/12197068050","plan_out_hash":"f543e3e00282f903bcb44c50e79bece885e3252fae37f17a631d153f55be848b","plan_hash":"0e6ebbbf5a21066158d27ba8f7474e88b71877083d1a3b9b1972adbcea3d4ccd","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./infrastructure/sudoblark__
<details>
<summary>Plan: 2 to add, 17 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api_gateway.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.api_gateway.data.aws_lambda_function.known_lambdas["backend-lambda"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_function" "known_lambdas" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       code_sha256                    = (known after apply)
+       code_signing_config_arn        = (known after apply)
+       dead_letter_config             = (known after apply)
+       description                    = (known after apply)
+       environment                    = (known after apply)
+       ephemeral_storage              = (known after apply)
+       file_system_config             = (known after apply)
+       function_name                  = "aws-prod-monsternames-api-backend-lambda"
+       handler                        = (known after apply)
+       id                             = (known after apply)
+       image_uri                      = (known after apply)
+       invoke_arn                     = (known after apply)
+       kms_key_arn                    = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = (known after apply)
+       logging_config                 = (known after apply)
+       memory_size                    = (known after apply)
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = (known after apply)
+       role                           = (known after apply)
+       runtime                        = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags                           = (known after apply)
+       timeout                        = (known after apply)
+       tracing_config                 = (known after apply)
+       version                        = (known after apply)
+       vpc_config                     = (known after apply)
    }

  # module.api_gateway.data.aws_region.current_region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current_region" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.additional_s3_files.module.s3_files.aws_s3_object.uploaded_files["config"] will be updated in-place
!~  resource "aws_s3_object" "uploaded_files" {
!~      etag                   = "50d6246d0015aa0767beeb2d399fd211" -> "7252813b8329cb78ef8c43ca4705fc21"
        id                     = "swagger_ui/index.html"
        tags                   = {}
!~      tags_all               = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
        }
!~      version_id             = "********************************" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.api_gateway.module.restapi_gateway.aws_api_gateway_api_key.api_keys["backend/ingestion"] will be updated in-place
!~  resource "aws_api_gateway_api_key" "api_keys" {
        id                = "sq6l5uhzai"
        name              = "backend/ingestion"
        tags              = {}
!~      tags_all          = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
        }
#        (6 unchanged attributes hidden)
    }

  # module.api_gateway.module.restapi_gateway.aws_api_gateway_deployment.deployments["backend"] must be replaced
+/- resource "aws_api_gateway_deployment" "deployments" {
!~      created_date  = "2024-12-04T15:15:06Z" -> (known after apply)
!~      execution_arn = "arn:aws:execute-api:eu-west-2:741139166799:dgo3yzs9ed/" -> (known after apply)
!~      id            = "******" -> (known after apply)
!~      invoke_url    = "https://dgo3yzs9ed.execute-api.eu-west-2.amazonaws.com/" -> (known after apply)
!~      triggers      = { # forces replacement
-           "redeployment" = "0c0f027b55cf81d8cac70e956b94a70cdc57a40e"
        } -> (known after apply) # forces replacement
#        (1 unchanged attribute hidden)
    }

  # module.api_gateway.module.restapi_gateway.aws_api_gateway_rest_api.api_gateway["backend"] will be updated in-place
!~  resource "aws_api_gateway_rest_api" "api_gateway" {
!~      body                         = <<-EOT
            # Copyright (c) 2023, Sudoblark Ltd
            #
            # All rights reserved.
            #
            # This source code is licensed under the BSD 3 clause license found in the
            # LICENSE file in the root directory of this source tree.
            
            openapi: 3.0.1
            info:
              title: Monsternames - OpenAPI 3.0
              description: |-
                This is a relatively simple RESTAPI, based on the OpenAPI 3.0 specification, which generates pseudo-random names for
                common fantasy monsters.
              license:
                name: BSD 3 clause
                url: https://raw.githubusercontent.com/sudoblark/sudoblark.monsternames.api/refs/heads/main/LICENSE.txt
              version: 1.1.0
            externalDocs:
              description: Source Code
              url: https://github.com/sudoblark/sudoblark.monsternames.api
            servers:
              - url: https://monsternames.sudoblark.com
            tags:
              - name: goatmen
                description: Names themed on cute fluffy animals
              - name: goblin
                description: Names themed on washed out wrestlers/average blokes
              - name: ogre
                description: Names themed on cavemen like speech
              - name: orc
                description: Names themed on {noun} + {silly moniker}
              - name: skeleton
                description: Names themed on 18th Century British Gentlemen
              - name: troll
                description: Names themed on a Scandinavian twist
            paths:
              /:
                get:
                  summary: Show Swagger UI
                  x-amazon-apigateway-integration:
                    httpMethod: "GET"
                    uri: "arn:aws:apigateway:eu-west-2:s3:path//prod-monsternames-api-assets/swagger_ui/index.html"
                    credentials: "arn:aws:iam::741139166799:role/aws-prod-monsternames-api-api-gateway-role"
                    type: "aws"
                    passthroughBehavior : "when_no_match"
                    responses:
                      "default": {
                        "statusCode": "200",
                        "responseParameters": {
                          "method.response.header.Content-Type": "'text/html'"
                        }
                      }
                  responses:
                    "200":
                      description: "Successful request"
                      content:
                        text/html:
                          schema:
                            type: string
                      headers:
                        "Content-Type":
                          $ref: '#/components/headers/Content-Type'
            
              /goatmen:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - goatmen
                  requestBody:
                    description: Add first name
                    required: true
                    content:
                      application/json:
                        schema:
                          $ref: "#/components/schemas/FirstNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
            
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
            
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - goatmen
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstName"
            
              /goblin:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - goblin
                  requestBody:
                    description: Add first and/or last name
                    required: true
                    content:
                      application/json:
                        schema:
                          anyOf:
                            - $ref: "#/components/schemas/FirstNameModel"
                            - $ref: "#/components/schemas/LastNameModel"
                            - $ref: "#/components/schemas/FirstAndLastNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
                          last_name:
                            $ref: "#/components/examples/LastName"
                          first_and_last_name:
                            $ref: "#/components/examples/FirstAndLastName"
            
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstAndLastName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
            
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - goblin
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstAndLastName"
            
              /ogre:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - ogre
                  requestBody:
                    description: Add first name
                    required: true
                    content:
                      application/json:
                        schema:
                          $ref: "#/components/schemas/FirstNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
            
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - ogre
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstName"
            
              /orc:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - orc
                  requestBody:
                    description: Add first and/or last name
                    required: true
                    content:
                      application/json:
                        schema:
                          anyOf:
                            - $ref: "#/components/schemas/FirstNameModel"
                            - $ref: "#/components/schemas/LastNameModel"
                            - $ref: "#/components/schemas/FirstAndLastNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
                          last_name:
                            $ref: "#/components/examples/LastName"
                          first_and_last_name:
                            $ref: "#/components/examples/FirstAndLastName"
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstAndLastName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
            
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - orc
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstAndLastName"
            
              /skeleton:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - skeleton
                  requestBody:
                    description: Add first and/or last name
                    required: true
                    content:
                      application/json:
                        schema:
                          anyOf:
                            - $ref: "#/components/schemas/FirstNameModel"
                            - $ref: "#/components/schemas/LastNameModel"
                            - $ref: "#/components/schemas/FirstAndLastNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
                          last_name:
                            $ref: "#/components/examples/LastName"
                          first_and_last_name:
                            $ref: "#/components/examples/FirstAndLastName"
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstAndLastName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
            
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - skeleton
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstAndLastName"
            
              /troll:
                post:
                  summary: Add pseudo-random name options
                  security:
                    - api_key: []
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  tags:
                    - troll
                  requestBody:
                    description: Add first and/or last name
                    required: true
                    content:
                      application/json:
                        schema:
                          anyOf:
                            - $ref: "#/components/schemas/FirstNameModel"
                            - $ref: "#/components/schemas/LastNameModel"
                            - $ref: "#/components/schemas/FirstAndLastNameModel"
                        examples:
                          first_name:
                            $ref: "#/components/examples/FirstName"
                          last_name:
                            $ref: "#/components/examples/LastName"
                          first_and_last_name:
                            $ref: "#/components/examples/FirstAndLastName"
                  responses:
                    "200":
                      $ref: "#/components/responses/200PostFirstAndLastName"
                    "400":
                      $ref: "#/components/responses/400PostInvalidBody"
                    "409":
                      $ref: "#/components/responses/409PostAlreadyExists"
                get:
                  summary: Retrieve a pseudo-random name
                  tags:
                    - troll
                  x-amazon-apigateway-integration:
                    httpMethod: "POST"
                    uri: "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:741139166799:function:aws-prod-monsternames-api-backend-lambda/invocations"
                    type: "aws_proxy"
                    passthroughBehavior : "when_no_match"
                  responses:
                    "200":
                      $ref: "#/components/responses/200GetFirstAndLastName"
            
            components:
              headers:
                Content-Type:
                  schema:
                    type: string
                    description: Type of content to return
            
              securitySchemes:
                api_key:
                  type: "apiKey"
                  name: "x-api-key"
                  in: "header"
            
              examples:
                FirstName:
                  summary: Add a new first name
                  value:
                    first_name: Barnaby
                LastName:
                  summary: Add a new last name
                  value:
                    last_name: The brass dragon
                FirstAndLastName:
                  summary: Add a new first and last name
                  value:
                    first_name: Barnaby
                    last_name: The brass dragon
              schemas:
                ErrorModel:
                  type: object
                  required:
                  - error
                  - message
                  properties:
                    error:
                      type: string
                    message:
                      type: string
            
                FirstNameModel:
                  type: object
                  required:
                  - first_name
                  properties:
                    first_name:
                      type: string
            
                LastNameModel:
                  type: object
                  required:
                  - last_name
                  properties:
                    last_name:
                      type: string
            
                FirstAndLastNameModel:
                  type: object
                  required:
                  - first_name
                  - last_name
                  properties:
                    first_name:
                      type: string
                    last_name:
                      type: string
            
              responses:
                200GetFirstName:
                  description: "Successful response"
                  content:
                    application/json:
                      schema:
                        type: object
                        required:
                        - first_name
                        - full_name
                        properties:
                          first_name:
                            type: string
                          full_name:
                            type: string
            
                200PostFirstName:
                  description: "Successful response"
                  content:
                    application/json:
                      schema:
                        type: object
                        required:
                        - first_name
                        - message
                        properties:
                          first_name:
                            type: string
                          message:
                            type: string
            
                200GetFirstAndLastName:
                  description: "Successful response"
                  content:
                    application/json:
                      schema:
                        type: object
                        required:
                        - first_name
                        - last_name
                        - full_name
                        properties:
                          first_name:
                            type: string
                          last_name:
                            type: string
                          full_name:
                            type: string
            
                200PostFirstAndLastName:
                  description: "Successful response"
                  content:
                    application/json:
                      schema:
                        type: object
                        required:
                        - message
                        properties:
                          first_name:
                            type: string
                          last_name:
                            type: string
                          message:
                            type: string
            
                400PostInvalidBody:
                  description: "Invalid body in POST"
                  content:
                    application/json:
                      schema:
                        $ref: "#/components/schemas/ErrorModel"
            
                409PostAlreadyExists:
                  description: "Duplicate record"
                  content:
                    application/json:
                      schema:
                        $ref: "#/components/schemas/ErrorModel"
        EOT -> (known after apply)
        id                           = "dgo3yzs9ed"
        name                         = "aws-prod-monsternames-api-backend"
        tags                         = {}
!~      tags_all                     = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
        }
#        (8 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.api_gateway.module.restapi_gateway.aws_api_gateway_stage.stages["backend"] will be updated in-place
!~  resource "aws_api_gateway_stage" "stages" {
!~      deployment_id         = "******" -> (known after apply)
        id                    = "ags-dgo3yzs9ed-prod"
        tags                  = {}
!~      tags_all              = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
        }
#        (8 unchanged attributes hidden)
    }

  # module.api_gateway.module.restapi_gateway.aws_api_gateway_usage_plan.usage_plans["backend"] will be updated in-place
!~  resource "aws_api_gateway_usage_plan" "usage_plans" {
        id          = "rx5lnx"
        name        = "backend-usage-plan"
        tags        = {}
!~      tags_all    = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
        }
#        (2 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # module.api_gateway.module.restapi_gateway.aws_lambda_permission.allow_execution["backend/aws-prod-monsternames-api-backend-lambda/deployment"] must be replaced
-/+ resource "aws_lambda_permission" "allow_execution" {
!~      id                  = "*********************************************" -> (known after apply)
!~      source_arn          = "arn:aws:execute-api:eu-west-2:741139166799:dgo3yzs9ed/*" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # module.iam_roles.module.iam_roles.aws_iam_policy.policy["api-gateway"] will be updated in-place
!~  resource "aws_iam_policy" "policy" {
        id               = "arn:aws:iam::741139166799:policy/aws-prod-monsternames-api-api-gateway-policy"
        name             = "aws-prod-monsternames-api-api-gateway-policy"
        tags             = {}
!~      tags_all         = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
        }
#        (5 unchanged attributes hidden)
    }

  # module.iam_roles.module.iam_roles.aws_iam_role.roles["api-gateway"] will be updated in-place
!~  resource "aws_iam_role" "roles" {
        id                    = "aws-prod-monsternames-api-api-gateway-role"
        name                  = "aws-prod-monsternames-api-api-gateway-role"
        tags                  = {}
!~      tags_all              = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
        }
#        (8 unchanged attributes hidden)
    }

  # module.s3_bucket.module.s3_bucket.data.aws_kms_key.known_keys["assets"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_kms_key" "known_keys" {
+       arn                             = (known after apply)
+       aws_account_id                  = (known after apply)
+       cloud_hsm_cluster_id            = (known after apply)
+       creation_date                   = (known after apply)
+       custom_key_store_id             = (known after apply)
+       customer_master_key_spec        = (known after apply)
+       deletion_date                   = (known after apply)
+       description                     = (known after apply)
+       enabled                         = (known after apply)
+       expiration_model                = (known after apply)
+       id                              = (known after apply)
+       key_id                          = "***************************************************************************"
+       key_manager                     = (known after apply)
+       key_spec                        = (known after apply)
+       key_state                       = (known after apply)
+       key_usage                       = (known after apply)
+       multi_region                    = (known after apply)
+       multi_region_configuration      = (known after apply)
+       origin                          = (known after apply)
+       pending_deletion_window_in_days = (known after apply)
+       valid_to                        = (known after apply)
+       xks_key_configuration           = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.aws_kms_alias.aliases["assets"] will be updated in-place
!~  resource "aws_kms_alias" "aliases" {
        id             = "alias/prod-monsternames-api-assets"
        name           = "alias/prod-monsternames-api-assets"
!~      target_key_id  = "************************************" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.s3_bucket.module.s3_bucket.aws_kms_key_policy.policies["assets"] will be updated in-place
!~  resource "aws_kms_key_policy" "policies" {
        id                                 = "e98f2c1f-6a3d-4fbd-8e13-81510573eafe"
!~      key_id                             = "************************************" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.s3_bucket.module.s3_bucket.aws_s3_object.prefixes["assets/swagger_ui/"] will be updated in-place
!~  resource "aws_s3_object" "prefixes" {
        id                     = "swagger_ui/"
        tags                   = {}
!~      tags_all               = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
        }
#        (13 unchanged attributes hidden)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["assets"].aws_kms_key.customer_managed_key[0] will be updated in-place
!~  resource "aws_kms_key" "customer_managed_key" {
        id                                 = "e98f2c1f-6a3d-4fbd-8e13-81510573eafe"
        tags                               = {}
!~      tags_all                           = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
        }
#        (11 unchanged attributes hidden)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["assets"].aws_s3_bucket.s3_bucket will be updated in-place
!~  resource "aws_s3_bucket" "s3_bucket" {
        id                          = "prod-monsternames-api-assets"
        tags                        = {}
!~      tags_all                    = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
        }
#        (9 unchanged attributes hidden)

#        (5 unchanged blocks hidden)
    }

  # module.lambda.module.lambda.module.lambdas["backend"].module.lambda.aws_cloudwatch_log_group.lambda[0] will be updated in-place
!~  resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/aws-prod-monsternames-api-backend-lambda"
        name              = "/aws/lambda/aws-prod-monsternames-api-backend-lambda"
        tags              = {
            "Name" = "aws-prod-monsternames-api-backend-lambda"
        }
!~      tags_all          = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
#            (1 unchanged element hidden)
        }
#        (4 unchanged attributes hidden)
    }

  # module.lambda.module.lambda.module.lambdas["backend"].module.lambda.aws_iam_policy.additional_json[0] will be updated in-place
!~  resource "aws_iam_policy" "additional_json" {
        id               = "arn:aws:iam::741139166799:policy/aws-prod-monsternames-api-backend-lambda"
        name             = "aws-prod-monsternames-api-backend-lambda"
        tags             = {
            "Name" = "aws-prod-monsternames-api-backend-lambda"
        }
!~      tags_all         = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
#            (1 unchanged element hidden)
        }
#        (5 unchanged attributes hidden)
    }

  # module.lambda.module.lambda.module.lambdas["backend"].module.lambda.aws_iam_policy.logs[0] will be updated in-place
!~  resource "aws_iam_policy" "logs" {
        id               = "arn:aws:iam::741139166799:policy/aws-prod-monsternames-api-backend-lambda-logs"
        name             = "aws-prod-monsternames-api-backend-lambda-logs"
        tags             = {
            "Name" = "aws-prod-monsternames-api-backend-lambda"
        }
!~      tags_all         = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
#            (1 unchanged element hidden)
        }
#        (5 unchanged attributes hidden)
    }

  # module.lambda.module.lambda.module.lambdas["backend"].module.lambda.aws_iam_role.lambda[0] will be updated in-place
!~  resource "aws_iam_role" "lambda" {
        id                    = "aws-prod-monsternames-api-backend-lambda"
        name                  = "aws-prod-monsternames-api-backend-lambda"
        tags                  = {
            "Name" = "aws-prod-monsternames-api-backend-lambda"
        }
!~      tags_all              = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
#            (1 unchanged element hidden)
        }
#        (8 unchanged attributes hidden)
    }

  # module.lambda.module.lambda.module.lambdas["backend"].module.lambda.aws_lambda_function.this[0] will be updated in-place
!~  resource "aws_lambda_function" "this" {
        id                             = "aws-prod-monsternames-api-backend-lambda"
!~      last_modified                  = "2024-12-04T15:14:59.000+0000" -> (known after apply)
!~      source_code_hash               = "hIALgfbgfTE8rW9PbKjcMsGeJVjyk+y774ZDhlIA7I4=" -> "xkZN4RK4oJsf5YMG+oHl7Q+jT0z8vvu9OOevSqqjrx0="
        tags                           = {
            "Name" = "aws-prod-monsternames-api-backend-lambda"
        }
!~      tags_all                       = {
+           "awsApplication" = "arn:aws:resource-groups:eu-west-2:741139166799:group/prod-monsternames-api-application/032snsvy459x73g7h09w4vdn1a"
+           "environment"    = "production"
+           "managed_by"     = "sudoblark.monsternames.api"
#            (1 unchanged element hidden)
        }
#        (21 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

Plan: 2 to add, 17 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.iam_roles.module.iam_roles.aws_iam_role.roles["api-gateway"],
  on /tmp/terraform-data-dir/modules/iam_roles.iam_roles/iam_role.tf line 7, in resource "aws_iam_role" "roles":
   7:   managed_policy_arns = [aws_iam_policy.policy[each.value["suffix"]].arn]

The managed_policy_arns argument is deprecated. Use the
aws_iam_role_policy_attachment resource instead. If Terraform should
exclusively manage all managed policy attachments (the current behavior of
this argument), use the aws_iam_role_policy_attachments_exclusive resource as
well.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #33](https://github.com/sudoblark/sudoblark.monsternames.api/actions/runs/12197068050)